{
    "_name_or_path": "dbmdz/bert-large-cased-finetuned-conll03-english-finetuned-money-date-by-Woguem",
    "_num_labels": 11,
    "architectures": [
        "BertForTokenClassification"
    ],
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "directionality": "bidi",
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 1024,
    "id2label": {
        "0": "O",
        "1": "B-PER",
        "2": "I-PER",
        "3": "B-ORG",
        "4": "I-ORG",
        "5": "B-LOC",
        "6": "I-LOC",
        "7": "B-MONEY",
        "8": "I-MONEY",
        "9": "B-DATE",
        "10": "I-DATE"
    },
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "label2id": {
        "B-DATE": 9,
        "B-LOC": 5,
        "B-MONEY": 7,
        "B-ORG": 3,
        "B-PER": 1,
        "I-DATE": 10,
        "I-LOC": 6,
        "I-MONEY": 8,
        "I-ORG": 4,
        "I-PER": 2,
        "O": 0
    },
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "pad_token_id": 0,
    "pooler_fc_size": 768,
    "pooler_num_attention_heads": 12,
    "pooler_num_fc_layers": 3,
    "pooler_size_per_head": 128,
    "pooler_type": "first_token_transform",
    "position_embedding_type": "absolute",
    "torch_dtype": "float32",
    "transformers_version": "4.49.0",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 28996
}